;Inno Setup XDELTA Patch Language file v1.3 for ISXPM 2.4.0.0
;Language: Italian
;Author: Vecna

[ISPATCH]
;Buttons
START_BUTTON='Inizia'
BROWSE_BUTTON='Sfoglia...'
INFO_BUTTON='Informazioni'
EXIT_BUTTON='Esci'
BACKUP_BUTTON='Salva copia di backup'
LOG_BUTTON='Salva Log'
MUSIC_BUTTON_PLAY='Musica'
MUSIC_BUTTON_PAUSE='Musica'
VERIFY_BUTTON='Verifica Hash'
CLOSE_BUTTON='Chiudi'

;Logs
ROLLBACK_STARTED='Rollback iniziato!'
ROLLBACK_END='Ƞavvenuto un errore. Rollback applicato. Ripristinati tutti i file patchati.'

FAILED_TO_ROLLBACK='[!]  Errore: Fallito il rollback da: '
FAILED_TO_ROLLBACK2=' file in: '


ROLLBACK_SUCCESS2=' a: '
ROLLBACK_SUCCESS3=' completato.'

FAILED_TO_DELETE_INCLUDED='[!]  Errore: Impossibile cancellare file inclusi: '

INCLUDED_DELETED_SUCCESS2=' cancellazione avvenuta con successo.'

INCLUDED_DIR_DELETED2=' vuota e cancellata con successo.'

BACKUP_DIR_DELETED2=' è stata cancellata.'

BACKUP_DIR_DELETED_NOT_FULLY2=' è stata eliminata ma alcuni file e cartelle non possono essere cancellate. Controllare questa cartella per altri dettagli.'

ROLLBACK_FINISHED='Rollback finito!'
PATCHING_FINIFHED_WITH_ERRORS='[!]  Sessione patch terminata con errori!'

EXTRACT_TEMP_PATCH_DATA='Estrazione dati patch nella cartella temporanea...'

START_PATCHING='[Avvio sessione di patching]'

TARGET_FILE='--> File da patchare: '
PATCH_DATA_FILE='=> File dati patch: '
OUTPUT_PATCHED='>> File  patchato: '

ERROR_DELETING_OLD_FILE='[!]  Errore avvenuto durante la cancellazione del vecchio file originale! Forse è in uso!'

NOT_EXISTS_OR_MISSMATCH='[!]  Errore: I file da patchare nella cartella selezionata non esistono o non corrispondono.'
CORRECT_PROBLEM='[!]  Prego, correggere il problema e applicare nuovamente la patch.'

PATCHING_END='[Fine sessione di patching]'
COPYING_START='[Inizio sessione di copia]'

COPY_FAILED='[!]  Errore: Impossibile copiare i file inclusi: '
COPY_FAILED2=' in:'

COPY_IN_USE='Forse '
COPY_IN_USE2=' in uso!'

INCLUDED_COPYIED2=' copiato in: '

COPYING_END='[Fine sessione di copia]'

TEMP_ROLLBACK_DELETED_IN_USE2=' è stata eliminata ma alcuni file e cartelle non possono essere cancellate. Controllare questa cartella per altri dettagli.'

EXTERNAL_COPYIED='File esterni aggiuntivi copiati in: '

STORED_BACKUP='File di backup salvati in: '

OPERATION_SUCCESS='Operazione completata con successo!'

;Checks
FIND_BY_WINDOW_NAME='Rilevata applicazione in esecuzione!'
FIND_BY_WINDOW_NAME2='Prego, chiudere '
FIND_BY_WINDOW_NAME3=' poi, avviare nuovamente la Patch!'

FIND_BY_CLASS_NAME='Rilevata applicazione in esecuzione!'
FIND_BY_CLASS_NAME2='Prego, chiudere '
FIND_BY_CLASS_NAME3=' poi, avviare nuovamente la Patch!'

FIND_BY_MUTEX='Rilevata applicazione in esecuzione!'
FIND_BY_MUTEX2='Prego, chiudere '
FIND_BY_MUTEX3=' poi, avviare nuovamente la Patch!'

FIND_BY_PROC='Rilevata applicazione in esecuzione!'
FIND_BY_PROC2='Prego, chiudere '
FIND_BY_PROC3=' poi, avviare nuovamente la Patch!'

;Errors
ORIGINAL_NOT_FOUND='Installazione originale non trovata! Prego, selezionare un percorso corretto!'

ROLLBACK_ERROR='Ƞavvenuto un errore durante la fase di patching e il rollback.'
ROLLBACK_ERROR2='Rollback dei file modificati completato. I file inclusi verranno eliminati.'
ROLLBACK_ERROR3='Rimuovere cartella di backup: '
ROLLBACK_ERROR4='con tutti i file inclusi e le sotto-cartelle?'

INCORRECR_PATH_ENTERED='Percorso inserito non corretto! Prego, selezionare la cartella d'installazione!'

NOTHING_TO_PATCH='Errore! Nella cartella di installazione non esistono i file richiesti per la patch!'
NOTHING_TO_PATCH2='Prego, controllare i file originali o il nome dei file nella cartella selezionata!'
NOTHING_TO_PATCH3='Non c'è niente da patchare!'
FINISHED_WITH_ERRORS='Patch terminata con errori! Controllare il file log per ulteriori dettagli!'
PATCH_UNSUCCESS='[!]  Errori avvenuti durante il processo di patch!'

;Informations
BROWSE_DIALOG='Prego, selezionare il percorso di destinazione:'

PATCHING_PROCESS='Processo di patching in corso, attendere prego...'
PATCH_APPLIED='La patch è stata applicata con successo!'
PATCHING='Patching: '
PATCHING_ERROR='La patch non è stata applicata!'
PATCHING_PREPARING='Preparazione al patching...'
COPYING_PROCESS='Processo di copia, attendere prego...'
COPYING_EXTERNAL='Copia in corso dei file esterni...'
FORM_CLOSED='La finestra di patch si chiuderࠡutomaticamente tra '
FORM_CLOSED2=' secondi.'

;new 0.8
DELETING_JUNKED='[Inizio sessione di cancellazione dei file inutili]'
COMPLETING_JUNKED='[Fine sessione di cancellazione dei file inutili]'
JUNKED_REMOVED='--> File inutili rimossi: '
JUNKED_REM_FAILED='[!]  Impossibile rimuovere i file inutili: '
FAILED_TO_RESTORE='[!]  Errore: Impossibile ripristinare i file inutili da: '
FAILED_TO_RESTORE2=' a: '
JUNKED_RESTORED='File inutili: '
JUNKED_RESTORED2=' è stato ipristinato con successo.'

;new 0.9
;ALLREADY_UPDATED='L'applicazione è stata aggiornata!'
;

; Language file 0.9a for ISXPM 2.0.0.0 beta 1 
INCORRECT_HASH='Il controllo del checksum non è nel file originale!'
INCORRECT_HASH2='Prego, controllare la versione del programma!'
INVALID_HASH='[!]  Errore! Checksum non valido per: '
VALID_HASH='OK! Checksum valido per: '

SET_ATTRIBUTES='Impostare attributi file...'
SET_ATTRIBUTES_FAILED='[!]  Impossibile impostare gli attributi originali dei file: '
SET_ATTRIBUTES_SUCCESS='Attributi dei file impostati con successo!'
SET_ATTRIBUTES_UNSUCCESS='[!]  Alcuni attributi dei file non sono stati impostati!'

HANDLE_ERROR='[!]  Ƞavvenuto un errore critico durante l'accesso a: '

GET_TIME_FAILED='[!]  Impossibile rilevare data/ora dal file: '
SET_TIME_FAILED='[!]  Impossibile impostare data/ora dal file: '

VERIFICATION_START='Inizio processo di verifica dei file...'
VERIFICATION_FINISH='Il checksum di tutti i file è risultato corretto!'

PREPARING_TO_OPERATIONS='Preparazione all'operazione successiva, in attesa dello scaricamento del motore di patching...'

FORCE_PATCHING='La patch verrࠥseguita in modalitࠦorza bruta!'
FORCE_PATCHING2='Verrࠡggiornato solo se presenti i file necessari, quelli non presenti verrano saltati...'

COPYING_EXTERNAL_FILE='--> Copia dei file in: '
COPYING_EXTERNAL_FILE_FAILED='[!]  Sono avvenuti alcuni errori durante la copia dei file: ' 

EXTRACTING_PROCESS='Estrazione file esterni...'
EXTRACTING_EXTERNAL_FILE='--> Estrazione file in: '
EXTERNAL_EXTRACTED='I file aggiuntivi esterni sono stati estratti in: '
EXTRACTING_START='Estrazione in corso...'

EXTRACTING_ERROR='[!]  Decompressione fallita! Forse l'archivio è corrotto!'
EXTRACTING_ERROR2='Ƞavvenuto un errore durante l'estrazione dell'archivio!'
EXTRACTING_ERROR3='Forse l'archivio è corrotto o lo spazio libero è insufficiente!'
EXTRACTING_WITH_ERRORS='Estrazione dell'archivio terminata con errori! Controllare il file log per ulteriori dettagli!'

DOWNLOAD_REQUIRED='Questa Patch ha bisogno di scaricare alcuni dati dal server!'
DOWNLOAD_FAILED='[!]  Impossibile continuare il processo di patch senza i dati richiesti!'
DOWNLOAD_FAILED2='Prego, fornire la connessione per l'accesso al server e provare ad applicare nuovamente la patch!'

DOWNLOAD_MIRROR='Impossibile scaricare i dati dal server principale! Prova a scaricarli da un mirror...'
DOWNLOAD_START='Scaricamento dati: '
DOWNLOAD_START2='Nella posizione: '
DOWNLOAD_START3='Dimensioni totali: '

READ_OK='Il download è avvenuto con successo!'
CONNECT_ERROR_NETWORK='[!]  Errore: Connessione ad Internet assente, o connessione non attiva.'
CONNECT_ERROR_OFFLINE='[!]  Errore: Il computer è in modalità offline.'
CONNECT_ERROR_INITIALIZE='[!]  Errore: Failed to initialize the installation package for accessing Internet.'
CONNECT_ERROR_OPENSESSION='[!]  Errore: Failed to open the FTP or HTTP session.'
CONNECT_ERROR_CREATEREQUEST='[!]  Errore: Failed to create an HTTP request handle.'
CONNECT_ERROR_SENDREQUEST='[!]  Errore: Failed to send request to the HTTP server.'
READ_ERROR_DELETEFILE='[!]  Errore: The local file exists, and failed to delete it.'
READ_ERROR_SAVEFILE='[!]  Errore: Failed to save data to the local file.'
READ_ERROR_CANCELED='[!]  Errore: The download operation is terminated by user.'
READ_ERROR_READDATA='[!]  Errore: Failed to read data from the remote URL.'
UNKNOWN_ERROR='[!]  Errore sconosciuto: lo stato del codice HTTP è'

CANCEL_DOWNLOAD_BUTTON='Annulla Download'

;old corrected
TOTAL_PATCHED_FILES='File elaborati in totale: '
PATCHING_LOG='Rapporto patch salvato in: '
INCLUDED_COPYIED='--> File inclusi: '
TEMP_ROLLBACK_DELETED='I file temporanei per il rollback sono stati eliminati in: '
DIRECT_PATCH_DATA='Accesso diretto ai dati patch...'

;Strings
DESCRIPTION='Descrizione:'
COPYRIGHT='Autore:'
CONTACT='Contatto:'
INSTALLATION='Installazione:'

;no more used this strings from previous old translation versions
;INCORRECT_MD5='MD5 hash is a not from original file!'
;INCORRECT_MD52='Please check your program version!'
;INVALID_HASH='[!]  Invalid MD5 hash for updated file: '
;VALID_HASH='Valid MD5 hash for updated file: '
;TEMP_ROLLBACK_DELETED2=' was deleted.'

; Language update 0.9b for ISXPM 2.0.0.0 beta 2 
PATCH_TO='Patch versione'
FOUNDED_VERSION='Versione installata trovata: '
VERSION_TO_PATCH='Preparazione alla versione gi࠴rovata: '

;old corrected:
;INSTALL_PATH_NOT_FOUND='Install path for required version not found! Please select it manually!'

ALLREADY_UPDATED='L'applicazione in questa posizione è già stata aggiornata!'
ROLLBACK_SUCCESS='Rollback: '
INCLUDED_DIR_DELETED='Cartella inclusa: '
INCLUDED_DELETED_SUCCESS='Inclusa: '
BACKUP_DIR_DELETED='Cartella di backup: '
BACKUP_DIR_DELETED_NOT_FULLY='Cartella di backup: '
TEMP_ROLLBACK_DELETED_IN_USE='Cartella temporanea di rollback: '

; Language update 1.0 for ISXPM 2.0.0.0 release candidate 
EXTRACT_TO_TEMP='Estrazione in corso dei dati temporanei necessari...'
EXTRACT_TO_TEMP2='Processo di estrazione in corso, prego, attendere...'
FOUNDED_VERSION_READY='Pronto per la Patch!'
FILE_NOT_EXISTS='[!]  Necessario per processare il file non esiste: '

;old corrected:
INSTALL_PATH_NOT_FOUND='Percorso di installazione per i(l) file da patchare non trovato.   Selezionarlo manualmente!'
FOUNDED_VERSION2='Trovata la versione installata! Pronto per la Patch!'
VERIFICATION_UNSUCCESS='[!]  Alcuni file non esistono o hanno un checksum errato!'
UNKNOWN_PATCHING_ERROR='[!]  Ƞavvenuto un errore durante l'applicazione della patch in: '

; Language update 1.1 for ISXPM 2.2.0.0 
LOG_BTN_STATE='Log'

S_PATCHING='--> File di patching: '
S_COPYING='--> File di copia: '
S_EXTRACTING='--> File estratti: '
S_COPYING_EXTERNAL='--> File esterni copiati: '
S_ROLLBACK='--> File di rollback: '
S_DELETING='--> File cancellati: '
S_JUNKED_RESTORED='--> File di scarto ripristinati: '
S_INVALID_FILE='[!]  File non validi: '
S_VALID_FILE='OK! File corretti: '

; Language update 1.2 for ISXPM 2.3.0.0 
VERSION_DETECTING='Rilevamento versione... Prego, attendere...'

; Language update 1.2.1 for ISXPM 2.3.1.0 
FILE_SKIPPED='[!]  i file seguenti non esistono e verranno saltati: '

; Language update 1.3 for ISXPM 2.4.0.0 
GET_SPACE_FAILED='Impossibile rilevare lo spazio libero su '
REQUIRED_SPACE='Lo spazio richiesto per aggiornare con successo è '
SPACE_GB='GB!'
SPACE_MB='MB!'
SPACE_ONLY='Ci sono solo '
SPACE_GB_FREE='GB liberi su disco '
SPACE_MB_FREE='MB liberi su disco '
SPACE_FREE_ONLY='liberi '
